Revit 2026 API

# IExtension Interface

---

An interface that supports the additional operation for Extension Status

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IExtension
```
```vb
Public Interface IExtension
```
```cpp
public interface class IExtension
```
```fsharp
type IExtension = interface end
```

The IExtension type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Extended | Retrieves or set the extension status at the end |
|  | HasMiter | Retrieves the miter status at the end |
|  | IsMiterLocked | Retrieves or set the miter locked status at the end. |
|  | SymbolicExtended | Retrieves or set the symbolic extension status at the end |

#### Reference

Autodesk.Revit.DB Namespace